eval_scripts/todo/vm_clone_experiment/write_performance_on_cloned_vm_images/fio_output/fioOut_8GB_randWrite_coldCache_4096bs_Ext4_1thread_asynchOff_btrfs
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=1064: Fri May 23 11:45:25 2025
  write: IOPS=4483, BW=17.5MiB/s (18.4MB/s)(8192MiB/467724msec)
    clat (usec): min=160, max=1090.1k, avg=219.63, stdev=5341.71
     lat (usec): min=161, max=1090.1k, avg=219.92, stdev=5341.71
    clat percentiles (usec):
     |  1.00th=[  167],  5.00th=[  172], 10.00th=[  172], 20.00th=[  174],
     | 30.00th=[  176], 40.00th=[  178], 50.00th=[  180], 60.00th=[  182],
     | 70.00th=[  186], 80.00th=[  192], 90.00th=[  198], 95.00th=[  206],
     | 99.00th=[  249], 99.50th=[  334], 99.90th=[  594], 99.95th=[  988],
     | 99.99th=[ 3687]
   bw (  KiB/s): min=   32, max=23440, per=100.00%, avg=18944.93, stdev=5356.78, samples=885
   iops        : min=    8, max= 5860, avg=4736.22, stdev=1339.19, samples=885
  lat (usec)   : 250=99.02%, 500=0.80%, 750=0.11%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.01%, 20=0.01%, 100=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=2.09%, sys=53.82%, ctx=2100725, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=17.5MiB/s (18.4MB/s), 17.5MiB/s-17.5MiB/s (18.4MB/s-18.4MB/s), io=8192MiB (8590MB), run=467724-467724msec

Disk stats (read/write):
  sda: ios=8410/2098218, merge=6106/1366, ticks=2761/508463, in_queue=145336, util=100.00%
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=1078: Fri May 23 11:56:07 2025
  write: IOPS=4512, BW=17.6MiB/s (18.5MB/s)(8192MiB/464708msec)
    clat (usec): min=163, max=1028.3k, avg=218.31, stdev=5170.16
     lat (usec): min=163, max=1028.3k, avg=218.60, stdev=5170.16
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  172], 10.00th=[  174], 20.00th=[  176],
     | 30.00th=[  176], 40.00th=[  178], 50.00th=[  180], 60.00th=[  182],
     | 70.00th=[  184], 80.00th=[  190], 90.00th=[  198], 95.00th=[  206],
     | 99.00th=[  243], 99.50th=[  347], 99.90th=[  660], 99.95th=[ 1106],
     | 99.99th=[ 3884]
   bw (  KiB/s): min=    8, max=23160, per=100.00%, avg=18738.07, stdev=5746.86, samples=895
   iops        : min=    2, max= 5790, avg=4684.49, stdev=1436.71, samples=895
  lat (usec)   : 250=99.11%, 500=0.66%, 750=0.15%, 1000=0.02%
  lat (msec)   : 2=0.03%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=2.06%, sys=55.69%, ctx=2101638, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=17.6MiB/s (18.5MB/s), 17.6MiB/s-17.6MiB/s (18.5MB/s-18.5MB/s), io=8192MiB (8590MB), run=464708-464708msec

Disk stats (read/write):
  sda: ios=8407/2098019, merge=6106/1370, ticks=2270/501677, in_queue=140200, util=99.98%
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=1284: Fri May 23 12:08:43 2025
  write: IOPS=3636, BW=14.2MiB/s (14.9MB/s)(8192MiB/576748msec)
    clat (usec): min=162, max=952741, avg=271.60, stdev=4075.66
     lat (usec): min=162, max=952741, avg=271.91, stdev=4075.67
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  172], 10.00th=[  172], 20.00th=[  174],
     | 30.00th=[  174], 40.00th=[  176], 50.00th=[  178], 60.00th=[  180],
     | 70.00th=[  188], 80.00th=[  196], 90.00th=[  258], 95.00th=[  338],
     | 99.00th=[ 1500], 99.50th=[ 3130], 99.90th=[ 8717], 99.95th=[15401],
     | 99.99th=[63701]
   bw (  KiB/s): min=   32, max=22768, per=100.00%, avg=14852.58, stdev=5912.37, samples=1129
   iops        : min=    8, max= 5692, avg=3713.11, stdev=1478.10, samples=1129
  lat (usec)   : 250=89.60%, 500=8.05%, 750=0.82%, 1000=0.27%
  lat (msec)   : 2=0.42%, 4=0.55%, 10=0.20%, 20=0.04%, 50=0.02%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.66%, sys=45.61%, ctx=2101783, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=14.2MiB/s (14.9MB/s), 14.2MiB/s-14.2MiB/s (14.9MB/s-14.9MB/s), io=8192MiB (8590MB), run=576748-576748msec

Disk stats (read/write):
  sda: ios=12078/2110588, merge=6056/34258, ticks=3881/576032, in_queue=185916, util=99.21%
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=920: Fri May 23 17:31:32 2025
  write: IOPS=4643, BW=18.1MiB/s (19.0MB/s)(8192MiB/451601msec)
    clat (usec): min=159, max=991013, avg=212.20, stdev=5108.38
     lat (usec): min=160, max=991013, avg=212.50, stdev=5108.38
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  169], 10.00th=[  172], 20.00th=[  172],
     | 30.00th=[  174], 40.00th=[  174], 50.00th=[  176], 60.00th=[  176],
     | 70.00th=[  180], 80.00th=[  186], 90.00th=[  194], 95.00th=[  200],
     | 99.00th=[  225], 99.50th=[  253], 99.90th=[  433], 99.95th=[  562],
     | 99.99th=[ 2900]
   bw (  KiB/s): min=    8, max=23568, per=100.00%, avg=19015.96, stdev=6422.84, samples=882
   iops        : min=    2, max= 5892, avg=4753.97, stdev=1605.71, samples=882
  lat (usec)   : 250=99.46%, 500=0.47%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 250=0.01%
  lat (msec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.98%, sys=56.94%, ctx=2100481, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=18.1MiB/s (19.0MB/s), 18.1MiB/s-18.1MiB/s (19.0MB/s-19.0MB/s), io=8192MiB (8590MB), run=451601-451601msec

Disk stats (read/write):
  sda: ios=19/2097937, merge=0/446, ticks=8/490507, in_queue=137060, util=100.00%